jyyy3901/GD32_HAL_Compat/Tests/test_dma_host.c
#include "stm32f4xx_hal.h"
#include "gd32_hal_port.h"
#include <assert.h>
#include <stdio.h>
#include <string.h>

static GD32_HAL_DMAConfig mock_config;
static uint32_t mock_configure_count;
static uint32_t mock_deinit_count;
static uint32_t mock_flags;
static uint32_t mock_interrupts;
static uint32_t mock_remaining;
static uint32_t mock_source;
static uint32_t mock_destination;
static uint32_t mock_length;
static GD32_HAL_DMADirection mock_direction;
static int mock_enabled;
static int mock_disable_stuck;
static const void *mock_owners[12];
static uint32_t mock_tick;
static int mock_tick_auto_increment;
static GD32_HAL_PortError mock_last_port_error;
static uint32_t mock_full_callback_count;
static uint32_t mock_half_callback_count;
static uint32_t mock_error_callback_count;
static uint32_t mock_abort_callback_count;
static uint8_t mock_events[16];
static uint32_t mock_event_count;

#define MOCK_EVENT_HALF  1U
#define MOCK_EVENT_FULL  2U
#define MOCK_EVENT_ERROR 3U
#define MOCK_EVENT_ABORT 4U

static int mock_instance_index(uint32_t address)
{
    uint32_t index;

    for (index = 0U; index <= 6U; ++index)
    {
        if (address == GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, index))
        {
            return (int)index;
        }
    }
    for (index = 0U; index <= 4U; ++index)
    {
        if (address == GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA1_ADDRESS, index))
        {
            return (int)(7U + index);
        }
    }
    return -1;
}

static void mock_reset(void)
{
    memset(&mock_config, 0, sizeof(mock_config));
    memset(mock_owners, 0, sizeof(mock_owners));
    mock_configure_count = 0U;
    mock_deinit_count = 0U;
    mock_flags = 0U;
    mock_interrupts = 0U;
    mock_remaining = 0U;
    mock_source = 0U;
    mock_destination = 0U;
    mock_length = 0U;
    mock_direction = GD32_HAL_DMA_DIRECTION_PERIPH_TO_MEMORY;
    mock_enabled = 0;
    mock_disable_stuck = 0;
    mock_tick = 0U;
    mock_tick_auto_increment = 0;
    mock_last_port_error = GD32_HAL_PORT_ERROR_NONE;
    mock_full_callback_count = 0U;
    mock_half_callback_count = 0U;
    mock_error_callback_count = 0U;
    mock_abort_callback_count = 0U;
    mock_event_count = 0U;
}

static DMA_HandleTypeDef mock_handle(DMA_Stream_TypeDef *instance,
                                     uint32_t request,
                                     uint32_t direction)
{
    DMA_HandleTypeDef hdma;

    memset(&hdma, 0, sizeof(hdma));
    hdma.Instance = instance;
    hdma.Init.Channel = request;
    hdma.Init.Direction = direction;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma.Init.MemInc = DMA_MINC_ENABLE;
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma.Init.Mode = DMA_NORMAL;
    hdma.Init.Priority = DMA_PRIORITY_HIGH;
    hdma.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    hdma.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
    hdma.Init.MemBurst = DMA_MBURST_SINGLE;
    hdma.Init.PeriphBurst = DMA_PBURST_SINGLE;
    hdma.State = HAL_DMA_STATE_RESET;
    return hdma;
}

uint32_t HAL_GetTick(void)
{
    uint32_t value = mock_tick;
    if (mock_tick_auto_increment != 0)
    {
        ++mock_tick;
    }
    return value;
}

void GD32_HAL_ErrorHook(GD32_HAL_PortError error, uint32_t detail)
{
    (void)detail;
    mock_last_port_error = error;
}

int GD32_HAL_DMA_IsInstance(uint32_t channel_address)
{
    return mock_instance_index(channel_address) >= 0;
}

int GD32_HAL_DMA_IsRequestValid(uint32_t channel_address,
                                uint32_t request,
                                GD32_HAL_DMADirection direction)
{
    int index = mock_instance_index(channel_address);
    uint32_t controller;
    uint32_t channel;

    if (index < 0)
    {
        return 0;
    }
    if (direction == GD32_HAL_DMA_DIRECTION_MEMORY_TO_MEMORY)
    {
        return request == GD32_DMA_REQUEST_MEMORY;
    }
    if ((request & 0x80000000UL) == 0U)
    {
        return 0;
    }
    controller = (index >= 7) ? 1U : 0U;
    channel = (index >= 7) ? (uint32_t)(index - 7) : (uint32_t)index;
    return (((request >> 16U) & 1U) == controller) &&
           (((request >> 8U) & 0xFFU) == channel) &&
           ((request & 0xFFU) != 0U);
}

uint32_t GD32_HAL_DMA_GetControllerAddress(uint32_t channel_address)
{
    int index = mock_instance_index(channel_address);
    assert(index >= 0);
    return (index >= 7) ? GD32_HAL_DMA1_ADDRESS : GD32_HAL_DMA0_ADDRESS;
}

uint32_t GD32_HAL_DMA_GetChannelIndex(uint32_t channel_address)
{
    int index = mock_instance_index(channel_address);
    assert(index >= 0);
    return (index >= 7) ? (uint32_t)(index - 7) : (uint32_t)index;
}

int GD32_HAL_DMA_Claim(uint32_t channel_address, const void *owner)
{
    int index = mock_instance_index(channel_address);
    assert(index >= 0);
    if ((mock_owners[index] != NULL) && (mock_owners[index] != owner))
    {
        return 0;
    }
    mock_owners[index] = owner;
    return 1;
}

void GD32_HAL_DMA_Release(uint32_t channel_address, const void *owner)
{
    int index = mock_instance_index(channel_address);
    assert(index >= 0);
    if (mock_owners[index] == owner)
    {
        mock_owners[index] = NULL;
    }
}

int GD32_HAL_DMA_Configure(uint32_t channel_address,
                           const GD32_HAL_DMAConfig *config)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    mock_config = *config;
    ++mock_configure_count;
    return 0;
}

void GD32_HAL_DMA_DeInit(uint32_t channel_address)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    ++mock_deinit_count;
}

void GD32_HAL_DMA_SetTransfer(uint32_t channel_address,
                              GD32_HAL_DMADirection direction,
                              uint32_t source,
                              uint32_t destination,
                              uint32_t count)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    mock_direction = direction;
    mock_source = source;
    mock_destination = destination;
    mock_length = count;
    mock_remaining = count;
}

void GD32_HAL_DMA_Enable(uint32_t channel_address)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    mock_enabled = 1;
}

void GD32_HAL_DMA_Disable(uint32_t channel_address)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    if (mock_disable_stuck == 0)
    {
        mock_enabled = 0;
    }
}

int GD32_HAL_DMA_IsEnabled(uint32_t channel_address)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    return mock_enabled;
}

uint32_t GD32_HAL_DMA_GetFlag(uint32_t channel_address, uint32_t flags)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    if ((flags & (GD32_HAL_DMA_FLAG_FIFO_UNSUPPORTED |
                  GD32_HAL_DMA_FLAG_DIRECT_UNSUPPORTED)) != 0U)
    {
        mock_last_port_error = GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_FLAG;
    }
    return mock_flags & flags;
}

