jyyy3901/GD32_HAL_Compat/Tests/test_dma_host.c
void GD32_HAL_DMA_ClearFlag(uint32_t channel_address, uint32_t flags)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    mock_flags &= ~flags;
}

void GD32_HAL_DMA_SetInterrupt(uint32_t channel_address,
                               uint32_t interrupts,
                               int enable)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    if ((interrupts & (GD32_HAL_DMA_INTERRUPT_FIFO_UNSUPPORTED |
                       GD32_HAL_DMA_INTERRUPT_DIRECT_UNSUPPORTED)) != 0U)
    {
        mock_last_port_error = GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_FLAG;
    }
    if (enable != 0)
    {
        mock_interrupts |= interrupts &
                           (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE);
    }
    else
    {
        mock_interrupts &= ~interrupts;
    }
}

uint32_t GD32_HAL_DMA_GetInterrupts(uint32_t channel_address)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    return mock_interrupts;
}

void GD32_HAL_DMA_SetRemaining(uint32_t channel_address, uint32_t count)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    mock_remaining = count;
}

uint32_t GD32_HAL_DMA_GetRemaining(uint32_t channel_address)
{
    assert(GD32_HAL_DMA_IsInstance(channel_address));
    return mock_remaining;
}

static void mock_full_callback(DMA_HandleTypeDef *hdma)
{
    (void)hdma;
    ++mock_full_callback_count;
    mock_events[mock_event_count++] = MOCK_EVENT_FULL;
}

static void mock_half_callback(DMA_HandleTypeDef *hdma)
{
    (void)hdma;
    ++mock_half_callback_count;
    mock_events[mock_event_count++] = MOCK_EVENT_HALF;
}

static void mock_error_callback(DMA_HandleTypeDef *hdma)
{
    assert((hdma->ErrorCode & HAL_DMA_ERROR_TE) != 0U);
    ++mock_error_callback_count;
    mock_events[mock_event_count++] = MOCK_EVENT_ERROR;
}

static void mock_abort_callback(DMA_HandleTypeDef *hdma)
{
    assert(hdma->State == HAL_DMA_STATE_READY);
    ++mock_abort_callback_count;
    mock_events[mock_event_count++] = MOCK_EVENT_ABORT;
}

static void test_init_and_guards(void)
{
    DMA_HandleTypeDef hdma;

    mock_reset();
    hdma = mock_handle(GD32_DMA0_CHANNEL3,
                       GD32_DMA_REQUEST_USART0_TX,
                       DMA_MEMORY_TO_PERIPH);
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(hdma.GD32_MAPPING_ORIGIN == GD32_HAL_DMA_MAPPING_NATIVE);
    assert(mock_configure_count == 1U);
    assert(mock_config.direction == GD32_HAL_DMA_DIRECTION_MEMORY_TO_PERIPH);
    assert(mock_config.memory_increment == 1U);
    assert(mock_config.priority == 2U);
    assert(hdma.StreamBaseAddress == GD32_HAL_DMA0_ADDRESS);
    assert(hdma.StreamIndex == 3U);
    assert(hdma.State == HAL_DMA_STATE_READY);

    hdma.Init.Channel = DMA_CHANNEL_4;
    assert(HAL_DMA_Init(&hdma) == HAL_ERROR);
    assert((hdma.ErrorCode & HAL_DMA_ERROR_REQUEST) != 0U);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_DMA_REQUEST_MISMATCH);

    hdma = mock_handle(DMA2_Stream7, DMA_CHANNEL_4,
                       DMA_MEMORY_TO_PERIPH);
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(hdma.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL3_ADDRESS);
    assert(hdma.GD32_REQUEST == GD32_DMA_REQUEST_USART0_TX);
    assert(hdma.Init.Channel == DMA_CHANNEL_4);
    assert(hdma.GD32_RESOLVED_FROM == (uintptr_t)DMA2_Stream7);
    assert(hdma.GD32_MAPPING_ORIGIN == GD32_HAL_DMA_MAPPING_STM32_UNIQUE);

    hdma = mock_handle(GD32_DMA0_CHANNEL3,
                       GD32_DMA_REQUEST_USART0_TX,
                       DMA_MEMORY_TO_PERIPH);
    hdma.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
    assert(HAL_DMA_Init(&hdma) == HAL_ERROR);
    assert((hdma.ErrorCode & HAL_DMA_ERROR_NOT_SUPPORTED) != 0U);

    hdma = mock_handle(GD32_DMA0_CHANNEL3,
                       GD32_DMA_REQUEST_USART0_TX,
                       DMA_MEMORY_TO_PERIPH);
    hdma.Init.Mode = DMA_PFCTRL;
    assert(HAL_DMA_Init(&hdma) == HAL_ERROR);
    assert((hdma.ErrorCode & HAL_DMA_ERROR_NOT_SUPPORTED) != 0U);

    hdma = mock_handle(GD32_DMA0_CHANNEL6,
                       GD32_DMA_REQUEST_MEMORY,
                       DMA_MEMORY_TO_MEMORY);
    hdma.Init.Mode = DMA_CIRCULAR;
    assert(HAL_DMA_Init(&hdma) == HAL_ERROR);
    assert((hdma.ErrorCode & HAL_DMA_ERROR_NOT_SUPPORTED) != 0U);

    hdma = mock_handle((DMA_Stream_TypeDef *)(uintptr_t)0x12345678U,
                       GD32_DMA_REQUEST_MEMORY,
                       DMA_MEMORY_TO_MEMORY);
    assert(HAL_DMA_Init(&hdma) == HAL_ERROR);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_INVALID_INSTANCE);
}

static void test_polling(void)
{
    DMA_HandleTypeDef hdma;

    mock_reset();
    hdma = mock_handle(GD32_DMA0_CHANNEL3,
                       GD32_DMA_REQUEST_USART0_TX,
                       DMA_MEMORY_TO_PERIPH);
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(HAL_DMA_Start(&hdma, 0x20000000U, 0x40013804U, 0U) == HAL_ERROR);
    assert(HAL_DMA_Start(&hdma, 0x20000000U, 0x40013804U, 8U) == HAL_OK);
    assert(hdma.State == HAL_DMA_STATE_BUSY);
    assert(hdma.Lock == HAL_LOCKED);
    assert(mock_source == 0x20000000U);
    assert(mock_destination == 0x40013804U);
    assert(mock_length == 8U);
    assert(HAL_DMA_Start(&hdma, 0x20000000U, 0x40013804U, 1U) == HAL_BUSY);

    mock_flags = GD32_HAL_DMA_FLAG_HALF;
    assert(HAL_DMA_PollForTransfer(&hdma, HAL_DMA_HALF_TRANSFER, 10U) == HAL_OK);
    assert(hdma.State == HAL_DMA_STATE_BUSY);
    assert(hdma.Lock == HAL_LOCKED);

    mock_flags = GD32_HAL_DMA_FLAG_FULL;
    assert(HAL_DMA_PollForTransfer(&hdma, HAL_DMA_FULL_TRANSFER, 10U) == HAL_OK);
    assert(hdma.State == HAL_DMA_STATE_READY);
    assert(hdma.Lock == HAL_UNLOCKED);
    assert(mock_enabled == 0);

    assert(HAL_DMA_Start(&hdma, 0x20000000U, 0x40013804U, 2U) == HAL_OK);
    mock_tick_auto_increment = 1;
    assert(HAL_DMA_PollForTransfer(&hdma, HAL_DMA_FULL_TRANSFER, 2U) == HAL_TIMEOUT);
    assert(hdma.ErrorCode == HAL_DMA_ERROR_TIMEOUT);
    assert(hdma.State == HAL_DMA_STATE_READY);
    mock_tick_auto_increment = 0;

    assert(HAL_DMA_Start(&hdma, 0x20000000U, 0x40013804U, 2U) == HAL_OK);
    mock_flags = GD32_HAL_DMA_FLAG_ERROR;
    assert(HAL_DMA_PollForTransfer(&hdma, HAL_DMA_FULL_TRANSFER, 10U) == HAL_ERROR);
    assert((hdma.ErrorCode & HAL_DMA_ERROR_TE) != 0U);
    assert(hdma.State == HAL_DMA_STATE_READY);

