jyyy3901/GD32_HAL_Compat/Tests/test_dma_host.c
    assert(HAL_DMA_Start(&hdma, 0x20000000U, 0x40013804U, 2U) == HAL_OK);
    mock_disable_stuck = 1;
    mock_tick_auto_increment = 1;
    assert(HAL_DMA_Abort(&hdma) == HAL_TIMEOUT);
    assert(hdma.State == HAL_DMA_STATE_TIMEOUT);
    assert(hdma.ErrorCode == HAL_DMA_ERROR_TIMEOUT);
    mock_tick_auto_increment = 0;
    mock_disable_stuck = 0;
    assert(HAL_DMA_DeInit(&hdma) == HAL_OK);
}

static void test_interrupt_and_circular(void)
{
    DMA_HandleTypeDef hdma;

    mock_reset();
    hdma = mock_handle(GD32_DMA1_CHANNEL4,
                       GD32_DMA_REQUEST_UART3_TX,
                       DMA_MEMORY_TO_PERIPH);
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(HAL_DMA_RegisterCallback(&hdma,
                                    HAL_DMA_XFER_CPLT_CB_ID,
                                    mock_full_callback) == HAL_OK);
    assert(HAL_DMA_RegisterCallback(&hdma,
                                    HAL_DMA_XFER_HALFCPLT_CB_ID,
                                    mock_half_callback) == HAL_OK);
    assert(HAL_DMA_RegisterCallback(&hdma,
                                    HAL_DMA_XFER_ERROR_CB_ID,
                                    mock_error_callback) == HAL_OK);
    assert(HAL_DMA_RegisterCallback(&hdma,
                                    HAL_DMA_XFER_ABORT_CB_ID,
                                    mock_abort_callback) == HAL_OK);

    assert(HAL_DMA_Start_IT(&hdma, 0x20000100U, 0x40004C04U, 16U) == HAL_OK);
    assert((mock_interrupts & (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE)) ==
           (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE));
    mock_flags = GD32_HAL_DMA_FLAG_HALF;
    HAL_DMA_IRQHandler(&hdma);
    assert(mock_half_callback_count == 1U);
    assert(hdma.State == HAL_DMA_STATE_BUSY);
    mock_flags = GD32_HAL_DMA_FLAG_FULL;
    HAL_DMA_IRQHandler(&hdma);
    assert(mock_full_callback_count == 1U);
    assert(hdma.State == HAL_DMA_STATE_READY);
    assert(mock_event_count == 2U);
    assert(mock_events[0] == MOCK_EVENT_HALF);
    assert(mock_events[1] == MOCK_EVENT_FULL);

    assert(HAL_DMA_Start_IT(&hdma, 0x20000100U, 0x40004C04U, 4U) == HAL_OK);
    mock_flags = GD32_HAL_DMA_FLAG_ERROR;
    HAL_DMA_IRQHandler(&hdma);
    assert(mock_error_callback_count == 1U);
    assert(hdma.State == HAL_DMA_STATE_READY);

    hdma.Init.Mode = DMA_CIRCULAR;
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(HAL_DMA_Start_IT(&hdma, 0x20000100U, 0x40004C04U, 4U) == HAL_OK);
    mock_flags = GD32_HAL_DMA_FLAG_FULL;
    HAL_DMA_IRQHandler(&hdma);
    mock_flags = GD32_HAL_DMA_FLAG_FULL;
    HAL_DMA_IRQHandler(&hdma);
    assert(mock_full_callback_count == 3U);
    assert(hdma.State == HAL_DMA_STATE_BUSY);
    assert(HAL_DMA_Abort_IT(&hdma) == HAL_OK);
    assert(mock_abort_callback_count == 1U);
    assert(hdma.State == HAL_DMA_STATE_READY);
}

static void test_directions_conflict_and_macros(void)
{
    typedef struct
    {
        DMA_HandleTypeDef *hdma;
    } ParentType;
    DMA_HandleTypeDef first;
    DMA_HandleTypeDef second;
    DMA_HandleTypeDef memory;
    ParentType parent = {0};

    mock_reset();
    first = mock_handle(GD32_DMA0_CHANNEL0,
                        GD32_DMA_REQUEST_ADC0,
                        DMA_PERIPH_TO_MEMORY);
    first.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    first.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_DMA_Init(&first) == HAL_OK);
    assert(mock_config.direction == GD32_HAL_DMA_DIRECTION_PERIPH_TO_MEMORY);
    assert(mock_config.periph_width == 2U);
    assert(mock_config.memory_width == 2U);

    second = first;
    second.Lock = HAL_UNLOCKED;
    second.State = HAL_DMA_STATE_RESET;
    second.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    second.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    assert(HAL_DMA_Init(&second) == HAL_OK);
    assert(HAL_DMA_Start(&first, 0x4001244DU, 0x20000200U, 4U) == HAL_ERROR);
    assert(first.State == HAL_DMA_STATE_READY);
    assert(HAL_DMA_Start(&first, 0x4001244CU, 0x20000200U, 4U) == HAL_OK);
    assert(mock_config.periph_width == 2U);
    assert(mock_config.memory_width == 2U);
    assert(HAL_DMA_Start(&second, 0x4001244CU, 0x20000300U, 4U) == HAL_BUSY);
    assert((second.ErrorCode & HAL_DMA_ERROR_CHANNEL_CONFLICT) != 0U);
    assert(HAL_DMA_Abort(&first) == HAL_OK);

    memory = mock_handle(GD32_DMA0_CHANNEL6,
                         GD32_DMA_REQUEST_MEMORY,
                         DMA_MEMORY_TO_MEMORY);
    memory.Init.PeriphInc = DMA_PINC_ENABLE;
    assert(HAL_DMA_Init(&memory) == HAL_OK);
    assert(mock_config.direction == GD32_HAL_DMA_DIRECTION_MEMORY_TO_MEMORY);
    assert(HAL_DMA_Start(&memory, 0x20001000U, 0x20002000U, 32U) == HAL_OK);
    assert(mock_direction == GD32_HAL_DMA_DIRECTION_MEMORY_TO_MEMORY);
    assert(HAL_DMA_Abort(&memory) == HAL_OK);

    __HAL_DMA_SET_COUNTER(&memory, 12U);
    assert(__HAL_DMA_GET_COUNTER(&memory) == 12U);
    mock_flags = GD32_HAL_DMA_FLAG_FULL;
    assert(__HAL_DMA_GET_FLAG(&memory, __HAL_DMA_GET_TC_FLAG_INDEX(&memory)) != 0U);
    __HAL_DMA_CLEAR_FLAG(&memory, GD32_HAL_DMA_FLAG_FULL);
    assert(mock_flags == 0U);
    __HAL_DMA_ENABLE_IT(&memory, DMA_IT_FE);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_FLAG);

    __HAL_LINKDMA(&parent, hdma, memory);
    assert(parent.hdma == &memory);
    assert(memory.Parent == &parent);
}

static void test_deinit_and_callback_guards(void)
{
    DMA_HandleTypeDef hdma;

    mock_reset();
    hdma = mock_handle(GD32_DMA0_CHANNEL5,
                       GD32_DMA_REQUEST_USART1_RX,
                       DMA_PERIPH_TO_MEMORY);
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(HAL_DMA_RegisterCallback(&hdma,
                                    HAL_DMA_XFER_M1CPLT_CB_ID,
                                    mock_full_callback) == HAL_ERROR);
    assert((hdma.ErrorCode & HAL_DMA_ERROR_NOT_SUPPORTED) != 0U);
    assert(HAL_DMA_CleanCallbacks(&hdma) == HAL_OK);
    assert(HAL_DMA_DeInit(&hdma) == HAL_OK);
    assert(mock_deinit_count == 1U);
    assert(hdma.State == HAL_DMA_STATE_RESET);
    assert(hdma.XferCpltCallback == NULL);
}

static void test_timer_stream_deferred_resolution(void)
{
    DMA_HandleTypeDef pwm;
    DMA_HandleTypeDef update;
    DMA_HandleTypeDef capture;
    DMA_HandleTypeDef unsupported;
    DMA_HandleTypeDef shared;
    DMA_HandleTypeDef blocker;
    DMA_HandleTypeDef old_channel_probe;
    uint32_t saved_instance;
    uint32_t saved_request;

    mock_reset();
    pwm = mock_handle(DMA1_Stream5, DMA_CHANNEL_3, DMA_MEMORY_TO_PERIPH);
    pwm.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    pwm.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_DMA_Init(&pwm) == HAL_OK);
    assert(pwm.GD32_DEFERRED != 0U);
    assert(pwm.GD32_MAPPING_ORIGIN == GD32_HAL_DMA_MAPPING_STM32_TIMER);
    assert(pwm.GD32_RESOURCE == NULL);
    assert(mock_configure_count == 0U);
    assert(GD32_HAL_DMA_ResolveForTimer(&pwm, GD32_HAL_TIMER1_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC1) == HAL_OK);
    assert(pwm.GD32_DEFERRED == 0U);
    assert(pwm.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL4_ADDRESS);
    assert(pwm.gd32_dma_periph == GD32_HAL_DMA0_ADDRESS);
    assert(pwm.gd32_dma_channel == 4U);
    assert(pwm.GD32_REQUEST == GD32_DMA_REQUEST_TIMER1_CH0);
    assert(mock_config.direction == GD32_HAL_DMA_DIRECTION_MEMORY_TO_PERIPH);
    assert(mock_config.periph_width == 2U);
    assert(mock_config.memory_width == 2U);

    capture = mock_handle(DMA1_Stream5, DMA_CHANNEL_3,
                          DMA_PERIPH_TO_MEMORY);
    capture.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    capture.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_DMA_Init(&capture) == HAL_OK);
    assert(HAL_DMA_Start(&pwm, 0x20001000U,
                         GD32_HAL_TIMER1_ADDRESS + 0x34U, 2U) == HAL_OK);
    assert(GD32_HAL_DMA_ResolveForTimer(&capture,
                                        GD32_HAL_TIMER1_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC1) == HAL_BUSY);
    assert((capture.ErrorCode & HAL_DMA_ERROR_CHANNEL_CONFLICT) != 0U);
    assert(HAL_DMA_Abort(&pwm) == HAL_OK);
    assert(GD32_HAL_DMA_ResolveForTimer(&capture,
                                        GD32_HAL_TIMER1_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC1) == HAL_OK);
    assert(mock_config.direction == GD32_HAL_DMA_DIRECTION_PERIPH_TO_MEMORY);

    update = mock_handle(DMA1_Stream1, DMA_CHANNEL_3,
                         DMA_MEMORY_TO_PERIPH);
    assert(HAL_DMA_Init(&update) == HAL_OK);
    assert(update.GD32_DEFERRED != 0U);
    assert(GD32_HAL_DMA_ResolveForTimer(&update, GD32_HAL_TIMER1_ADDRESS,
                                        GD32_HAL_TIMER_DMA_UPDATE) == HAL_OK);
    assert(update.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL1_ADDRESS);
    assert(update.GD32_REQUEST == GD32_DMA_REQUEST_TIMER1_UP);

