jyyy3901/GD32_HAL_Compat/Tests/test_dma_host.c
    assert(capture.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL4_ADDRESS);
    assert(capture.GD32_REQUEST == GD32_DMA_REQUEST_TIMER1_CH0);

    unsupported = mock_handle(DMA1_Stream1, DMA_CHANNEL_3,
                              DMA_MEMORY_TO_PERIPH);
    assert(HAL_DMA_Init(&unsupported) == HAL_OK);
    assert(GD32_HAL_DMA_ResolveForTimer(&unsupported,
                                        GD32_HAL_TIMER1_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC2) == HAL_ERROR);
    assert(unsupported.GD32_DEFERRED != 0U);
    assert((unsupported.ErrorCode & HAL_DMA_ERROR_REQUEST) != 0U);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED);
    assert(HAL_DMA_DeInit(&unsupported) == HAL_OK);
    assert(unsupported.State == HAL_DMA_STATE_RESET);

    shared = mock_handle(DMA2_Stream6, DMA_CHANNEL_0,
                         DMA_MEMORY_TO_PERIPH);
    shared.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    shared.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_DMA_Init(&shared) == HAL_OK);
    assert(shared.GD32_MAPPING_ORIGIN == GD32_HAL_DMA_MAPPING_STM32_TIMER);
    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC1) == HAL_OK);
    assert(shared.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL1_ADDRESS);
    assert(shared.GD32_REQUEST == GD32_DMA_REQUEST_TIMER0_CH0);
    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC1) == HAL_OK);

    assert(HAL_DMA_Start(&shared, 0x20002000U,
                         GD32_HAL_TIMER0_ADDRESS + 0x34U, 2U) == HAL_OK);
    saved_instance = shared.GD32_INSTANCE;
    saved_request = shared.GD32_REQUEST;
    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC2) == HAL_BUSY);
    assert(shared.GD32_INSTANCE == saved_instance);
    assert(shared.GD32_REQUEST == saved_request);
    assert(HAL_DMA_Abort(&shared) == HAL_OK);

    old_channel_probe = mock_handle(GD32_DMA0_CHANNEL1,
                                    GD32_DMA_REQUEST_TIMER0_CH0,
                                    DMA_MEMORY_TO_PERIPH);
    old_channel_probe.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    old_channel_probe.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_DMA_Init(&old_channel_probe) == HAL_OK);
    assert(GD32_HAL_DMA_ResolveForTimer(
               &old_channel_probe, GD32_HAL_TIMER0_ADDRESS,
               GD32_HAL_TIMER_DMA_CC2) == HAL_OK);
    assert(old_channel_probe.GD32_INSTANCE ==
           GD32_HAL_DMA0_CHANNEL1_ADDRESS);
    assert(old_channel_probe.GD32_REQUEST == GD32_DMA_REQUEST_TIMER0_CH0);
    assert(HAL_DMA_Start(&old_channel_probe, 0x20002500U,
                         GD32_HAL_TIMER0_ADDRESS + 0x34U, 2U) == HAL_OK);
    assert(HAL_DMA_Abort(&old_channel_probe) == HAL_OK);

    blocker = mock_handle(GD32_DMA0_CHANNEL2,
                          GD32_DMA_REQUEST_TIMER0_CH1,
                          DMA_MEMORY_TO_PERIPH);
    blocker.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    blocker.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_DMA_Init(&blocker) == HAL_OK);
    assert(blocker.GD32_MAPPING_ORIGIN == GD32_HAL_DMA_MAPPING_NATIVE);
    assert(HAL_DMA_Start(&blocker, 0x20003000U,
                         GD32_HAL_TIMER0_ADDRESS + 0x38U, 2U) == HAL_OK);
    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC2) == HAL_BUSY);
    assert(shared.GD32_INSTANCE == saved_instance);
    assert(shared.GD32_REQUEST == saved_request);
    assert(shared.GD32_MAPPING_ORIGIN ==
           GD32_HAL_DMA_MAPPING_STM32_TIMER);
    assert(shared.State == HAL_DMA_STATE_READY);
    assert((shared.ErrorCode & HAL_DMA_ERROR_CHANNEL_CONFLICT) != 0U);
    assert(HAL_DMA_Abort(&blocker) == HAL_OK);

    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC2) == HAL_OK);
    assert(shared.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL2_ADDRESS);
    assert(shared.GD32_REQUEST == GD32_DMA_REQUEST_TIMER0_CH1);
    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC3) == HAL_OK);
    assert(shared.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL5_ADDRESS);
    assert(shared.GD32_REQUEST == GD32_DMA_REQUEST_TIMER0_CH2);
    saved_instance = shared.GD32_INSTANCE;
    saved_request = shared.GD32_REQUEST;
    assert(GD32_HAL_DMA_ResolveForTimer(&shared, GD32_HAL_TIMER0_ADDRESS,
                                        GD32_HAL_TIMER_DMA_CC4) == HAL_ERROR);
    assert((shared.ErrorCode & HAL_DMA_ERROR_REQUEST) != 0U);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED);
    assert(shared.GD32_INSTANCE == saved_instance);
    assert(shared.GD32_REQUEST == saved_request);
}

int main(void)
{
    test_init_and_guards();
    test_polling();
    test_interrupt_and_circular();
    test_directions_conflict_and_macros();
    test_deinit_and_callback_guards();
    test_timer_stream_deferred_resolution();
    puts("DMA polling, interrupt and conflict host tests: PASS");
    return 0;
}
int GD32_HAL_TIMER_GetDMAMapping(uint32_t timer_address,
                                 GD32_HAL_TIMERDMARequest request,
                                 uint32_t *channel_address,
                                 uint32_t *request_token)
{
    if ((channel_address == NULL) || (request_token == NULL))
    {
        return 0;
    }
    if (timer_address == GD32_HAL_TIMER0_ADDRESS)
    {
        if (request == GD32_HAL_TIMER_DMA_CC1)
        {
            *channel_address = GD32_HAL_DMA0_CHANNEL1_ADDRESS;
            *request_token = GD32_DMA_REQUEST_TIMER0_CH0;
            return 1;
        }
        if (request == GD32_HAL_TIMER_DMA_CC2)
        {
            *channel_address = GD32_HAL_DMA0_CHANNEL2_ADDRESS;
            *request_token = GD32_DMA_REQUEST_TIMER0_CH1;
            return 1;
        }
        if (request == GD32_HAL_TIMER_DMA_CC3)
        {
            *channel_address = GD32_HAL_DMA0_CHANNEL5_ADDRESS;
            *request_token = GD32_DMA_REQUEST_TIMER0_CH2;
            return 1;
        }
        return 0;
    }
    if (timer_address != GD32_HAL_TIMER1_ADDRESS)
    {
        return 0;
    }
    if (request == GD32_HAL_TIMER_DMA_CC1)
    {
        *channel_address = GD32_HAL_DMA0_CHANNEL4_ADDRESS;
        *request_token = GD32_DMA_REQUEST_TIMER1_CH0;
        return 1;
    }
    if (request == GD32_HAL_TIMER_DMA_UPDATE)
    {
        *channel_address = GD32_HAL_DMA0_CHANNEL1_ADDRESS;
        *request_token = GD32_DMA_REQUEST_TIMER1_UP;
        return 1;
    }
    return 0;
}
